;******************************************************************
; マクロ
;******************************************************************
%include        "../include/define.s"
%include        "../include/macro.s"

        ORG     BOOT_LOAD                       ; ロードアドレスをアセンブラに指示

;******************************************************************
; エントリポイント
;******************************************************************
entry:
        ;---------------------------------------
        ; BPB (BIOS Parameter Block)
        ;---------------------------------------
        jmp     ipl                             ; 0x00( 3) ブートコードへのジャンプ命令 2バイトまたは3バイトのJMP命令
        times   3 - ($ - $$)  db  0x90          ;          2バイトコードの場合はNOP命令（0x90）で埋める
        db      'OEM-NAME'                      ; 0x03( 8) OEM名
                                                ; ------------------------------------------------
        dw      512                             ; 0x0B( 2) セクタのバイト数 デバイスに依存する
        db      1                               ; 0x0D( 1) クラスタのセクタ数
        dw      32                              ; 0x0E( 2) 予約セクタ数 FAT領域（BPBとブートプログラムの後）までのセクタ数で
        db      2                               ; 0x10( 1) FAT数 FAT領域は冗長性を持たせために2つ用意するのが一般的
        dw      512                             ; 0x11( 2) ルートエントリ数 512が仕様書に記載されている推奨値
        dw      0xFFF0                          ; 0x13( 2) 総セクタ数16 セクタ数が0x1000未満であればこちらを設定
        db      0xF8                            ; 0x15( 1) メディアタイプ 0xF8: 固定ハードディスク等, 0xF0: リムーバブルディスク
        dw      256                             ; 0x16( 2) FATのセクタ数 値が大きいほど多くのインデックスが作成可能
        dw      0x10                            ; 0x18( 2) トラックのセクタ数
        dw      2                               ; 0x1A( 2) ヘッド数
        dd      0                               ; 0x1C( 4) 隠されたヘッド数 パーティションを切っている場合のBPBまでのセクタ数
                                                ; ------------------------------------------------
        dd      0                               ; 0x20( 4) 総セクタ数132 セクタ数が0x1000以上であればこちらを設定
        db      0x80                            ; 0x24( 1) ドライブ番号
        db      0                               ; 0x25( 1) 予約
        db      0x29                            ; 0x26( 1) ブートフラグ ここに設定された値によって後続の3項目の有効/無効が変わる
        dd      0xbeef                          ; 0x27( 4) シリアルナンバー
        db      'BOOTABLE   '                   ; 0x2B(11) ボリュームラベル
        db      'FAT16   '                      ; 0x36( 8) FATタイプ

        ;---------------------------------------
        ; IPL (Initial Program Loader)
        ;---------------------------------------
ipl:
        cli                                     ; 割り込み禁止

        mov     ax, 0x0000                      ; AX = 0x0000 セグメントレジスタに設定する初期値
        mov     ds, ax
        mov     es, ax
        mov     ss, ax
        mov     sp, BOOT_LOAD                   ; スタックポインタにロード位置のアドレスを設定

        sti                                     ; 割り込み許可

        mov     [BOOT + drive.no], dl           ; ブートドライブを保存

        ;---------------------------------------
        ; 文字列を表示
        ;---------------------------------------
        cdecl   puts, .s0                       ; puts(.s0)

        ;---------------------------------------
        ; 残りのセクタを読み込む
        ;---------------------------------------
        mov     bx, BOOT_SECT - 1               ; BX = 残りのセクタ数
        mov     cx, BOOT_LOAD + SECT_SIZE       ; CX = 次のロードアドレス

        cdecl   read_chs, BOOT, bx, cx          ; AX = read_chs(BOOT, BX, CX)

        cmp     ax, bx                          ; AX（読み込んだセクタ数）とBX（残りセクタ数）が
.10Q:   jz      .10E                            ; 異なる場合は読み出し失敗と判断し
.10T:   cdecl   puts, .e0                       ; エラーメッセージを表示してから
        call    reboot                          ; 再起動する
.10E:

        ;---------------------------------------
        ; 次のステージへ移行
        ;---------------------------------------
        jmp     stage_2nd                       ; ブート処理の第2ステージ

        ;---------------------------------------
        ; データ
        ;---------------------------------------
.s0     db "Booting...", 0x0A, 0x0D, 0
.e0     db "Error: sctor read", 0

;******************************************************************
; ブートドライブに関する情報
;******************************************************************
ALIGN 2, db 0
BOOT:                                           ; ブートドライブに関する情報
    istruc      drive
        at      drive.no,       dw 0            ; ドライブ番号
        at      drive.cyln,     dw 0            ; C: シリンダ
        at      drive.head,     dw 0            ; H: ヘッド
        at      drive.sect,     dw 2            ; S: セクタ
    iend

;******************************************************************
; モジュール
;******************************************************************
%include        "../modules/real/puts.s"
%include        "../modules/real/reboot.s"
%include        "../modules/real/read_chs.s"

;******************************************************************
; ブートフラグ（先頭512バイトの終了）
; 0xAA55 は「ブートシグネチャ」と呼ばれるMBRの有効性を示す決まった値のデータ
; $ : 現在の番地
; $$: 先頭番地
;******************************************************************
        times   510 - ($ - $$)  db  0x00
        db      0x55, 0xAA

;******************************************************************
; リアルモードで取得した情報
;******************************************************************
FONT:                                           ; フォント
        .seg:   dw 0
        .off:   dw 0
ACPI_DATA:                                      ; ACPI data
        .adr:   dd 0                            ; ACPI data address
        .len:   dd 0                            ; ACPI data length

;******************************************************************
; モジュール（第2ステージ以降用）
;******************************************************************
%include        "../modules/real/itoa.s"
%include        "../modules/real/get_drive_param.s"
%include        "../modules/real/get_font_adr.s"
%include        "../modules/real/get_mem_info.s"
%include        "../modules/real/kbc.s"
%include        "../modules/real/lba_chs.s"
%include        "../modules/real/read_lba.s"

;******************************************************************
; ブート処理の第2ステージ
;******************************************************************
stage_2nd:

        ;---------------------------------------
        ; 文字列を表示
        ;---------------------------------------
        cdecl   puts, .s0                       ; puts(.s0)

        ;---------------------------------------
        ; ドライブ情報を取得
        ;---------------------------------------
        cdecl get_drive_param, BOOT             ; get_drive_param(DX, BOOT.CYLN)
        cmp     ax, 0                           ;
.10Q:   jne     .10E                            ;
.10T:   cdecl   puts, .e0                       ;
        call    reboot                          ;
.10E:

        ;---------------------------------------
        ; ドライブ情報を表示
        ;---------------------------------------
        mov     ax, [BOOT + drive.no]           ; AX = ブートドライブ
        cdecl   itoa, ax, .p1, 2, 16, 0b0100    ;
        mov     ax, [BOOT + drive.cyln]         ;
        cdecl   itoa, ax, .p2, 4, 16, 0b0100    ;
        mov     ax, [BOOT + drive.head]         ; AX = ヘッド数
        cdecl   itoa, ax, .p3, 2, 16, 0b0100    ;
        mov     ax, [BOOT + drive.sect]         ; AX = トラックあたりのセクタ数
        cdecl   itoa, ax, .p4, 2, 16, 0b0100    ;
        cdecl   puts, .s1

        ;---------------------------------------
        ; 次のステージへ移行
        ;---------------------------------------
        jmp     stage_3rd

        ;---------------------------------------
        ; データ
        ;---------------------------------------
.s0     db "2nd stage...", 0x0A, 0x0D, 0

.s1     db " Drive:0x"
.p1     db "  , C:0x"
.p2     db "    , H:0x"
.p3     db "  , S:0x"
.p4     db "  ", 0x0A, 0x0D, 0

.e0     db "Can't get drive patameter.", 0

;******************************************************************
; ブート処理の第3ステージ
;******************************************************************
stage_3rd:

        ;---------------------------------------
        ; 文字列を表示
        ;---------------------------------------
        cdecl   puts, .s0                       ; puts(.s0)

        ;---------------------------------------
        ; BIOSに内蔵されているフォントを
        ; プロテクトモードで利用するフォントとして流用
        ;---------------------------------------
        cdecl   get_font_adr, FONT

        ;---------------------------------------
        ; フォントアドレスを表示
        ;---------------------------------------
        cdecl   itoa, word [FONT.seg], .p1, 4, 16, 0b0100
        cdecl   itoa, word [FONT.off], .p2, 4, 16, 0b0100
        cdecl   puts, .s1

        ;---------------------------------------
        ; メモリ情報の取得と表示
        ;---------------------------------------
        cdecl   get_mem_info                    ;

        mov     eax, [ACPI_DATA.adr]            ;
        cmp     eax, 0                          ;
        je      .10E                            ;

        cdecl   itoa, ax, .p4, 4, 16, 0b0100    ; 下位アドレスを変換
        shr     eax, 16
        cdecl   itoa, ax, .p3, 4, 16, 0b0100    ; 上位アドレスを変換
        cdecl   puts, .s2                       ; アドレスを表示
.10E:
        ;---------------------------------------
        ; 次のステージへ移行
        ;---------------------------------------
        jmp     stage_4th

        ;---------------------------------------
        ; データ
        ;---------------------------------------
.s0     db "3rd stage...", 0x0A, 0x0D, 0

.s1     db " Font Address="
.p1     db "ZZZZ:"
.p2     db "ZZZZ", 0x0A, 0x0D, 0
        db 0x0A, 0x0D, 0

.s2     db " ACPI data="
.p3     db "ZZZZ"
.p4     db "ZZZZ", 0x0A, 0x0D, 0

;******************************************************************
; ブート処理の第4ステージ
;******************************************************************
stage_4th:
        ;---------------------------------------
        ; 文字列を表示
        ;---------------------------------------
        cdecl   puts, .s0

        ;---------------------------------------
        ; A20ゲートの有効化
        ;---------------------------------------
        cli                                     ; 割り込み禁止

        cdecl   KBC_Cmd_Write, 0xAD             ; キーボード無効化

        cdecl   KBC_Cmd_Write, 0xD0             ; 出力ポート読み出しコマンド
        cdecl   KBC_Data_Read, .key             ; 出力ポートデータを .key に格納

        mov     bl, [.key]                      ; BL = key
        or      bl, 0x02                        ; 出力ポートにA20ゲート信号 B1 をセット

        cdecl   KBC_Cmd_Write, 0xD1             ; 出力ポート書き込みコマンド
        cdecl   KBC_Data_Write, bx              ; 出力ポートデータを再設定

        cdecl   KBC_Cmd_Write, 0xAE             ; キーボード有効化

        sti                                     ; 割り込み許可

        ;---------------------------------------
        ; 文字列を表示
        ;---------------------------------------
        cdecl   puts, .s1

        ;---------------------------------------
        ; キーボードLEDのテスト
        ;---------------------------------------
        cdecl   puts, .s2

        mov     bx, 0
.10L:
        mov     ah, 0x00                        ;
        int     0x16                            ; キー入力待ち

        cmp     al, '1'                         ;
        jb      .10E                            ; 入力された値が1,2,3以外であれば
        cmp     al, '3'                         ; 処理を終了する
        ja      .10E                            ;

        mov     cl, al                          ; CL = キー入力
        dec     cl                              ; CL -= 1
        and     cl, 0x03                        ; CL &= 0x03
        mov     ax, 0x0001                      ; AX = 0x0001
        shl     ax, cl                          ; AX <<= CL
        xor     bx, ax                          ; BX ^= AX

        ;---------------------------------------
        ; LEDコマンドの送信
        ;---------------------------------------
        cli                                     ; 割り込み禁止

        cdecl   KBC_Cmd_Write, 0xAD             ; キーボード無効化

        cdecl   KBC_Data_Write, 0xED            ; LEDコマンド
        cdecl   KBC_Data_Read, .key             ; 受信応答

        cmp     [.key], byte 0xFA
        jne     .11F

        cdecl   KBC_Data_Write, bx              ; LEDデータ出力
        jmp     .11E

.11F:
        cdecl   itoa, word [.key], .e1, 2, 16, 0b0100
        cdecl   puts, .e0                       ; 受信コード表示

.11E:
        cdecl   KBC_Cmd_Write, 0xAE             ; キーボード有効化

        sti                                     ; 割り込み許可

        jmp     .10L

.10E:

        ;---------------------------------------
        ; 文字列を表示
        ;---------------------------------------
        cdecl   puts, .s3

        ;---------------------------------------
        ; 次のステージへ移行
        ;---------------------------------------
        jmp     stage_5th

.s0:    db "4th stage...", 0x0A, 0x0D, 0
.s1:    db " A20 Gate Enabled.", 0x0A, 0x0D, 0
.s2:    db " Keyborad LED Test...", 0
.s3:    db " (done)", 0x0A, 0x0D, 0
.e0:    db "["
.e1:    db "ZZ]", 0

.key:   dw 0

;******************************************************************
; ブート処理の第5ステージ
;******************************************************************
stage_5th:
        ;---------------------------------------
        ; 文字列を表示
        ;---------------------------------------
        cdecl   puts, .s0

        ;---------------------------------------
        ; カーネルを読み込む
        ;---------------------------------------
        cdecl   read_lba, BOOT, BOOT_SECT, KERNEL_SECT, BOOT_END
                                                ; AX = read_lba(.lba, ...)
        cmp     ax, KERNEL_SECT                 ;
.10Q:   jz      .10E
.10T:   cdecl   puts, .e0                       ;
        call    reboot
.10E:

        ;---------------------------------------
        ; 次のステージへ移行
        ;---------------------------------------
        jmp     stage_6th                       ; 無限ループ

.s0:    db "5th stage...", 0x0A, 0x0D, 0
.e0:    db " Failure load kernel...", 0x0A, 0x0D, 0

;******************************************************************
; ブート処理の第6ステージ
;******************************************************************
stage_6th:
        ;---------------------------------------
        ; 文字列を表示
        ;---------------------------------------
        cdecl   puts, .s0

        ;---------------------------------------
        ; ユーザからの入力待ち
        ;---------------------------------------
.10L:
        mov     ah, 0x00                        ; キー入力待ち
        int     0x16                            ; AL = BIOS(0x16, 0x00)
        cmp     al, ' '                         ; ZF = AL == ' '
        jne     .10L

        ;---------------------------------------
        ; ビデオモードの設定
        ;---------------------------------------
        mov     ax, 0x0012                      ; VGA 640x480
        int     0x10                            ; BIOS(0x10, 0x12)

        ;---------------------------------------
        ; 次のステージへ移行
        ;---------------------------------------
        jmp     stage_7th                       ; 無限ループ

.s0:    db "6th stage...", 0x0A, 0x0D, 0x0A, 0x0D
        db " [Push SPACE key to protect mode...]", 0x0A, 0x0D, 0

;******************************************************************
; GLOBAL DESCRIPTOR TABLE
; （セグメントディスクリプタの並列）
;******************************************************************
ALIGN 4, db 0
GDT:    dq 0x00_0_0_0_0_000000_0000             ; NULL
.cs:    dq 0x00_C_F_9_A_000000_FFFF             ; コード用セグメントディスクリプタ
.ds:    dq 0x00_C_F_9_2_000000_FFFF             ; データ用セグメントディスクリプタ
.gdt_end:

;===============================================
; セレクタ
;===============================================
SEL_CODE        equ .cs - GDT                   ; コード用セレクタ
SEL_DATA        equ .ds - GDT                   ; データ用セレクタ

;===============================================
; GDT
;===============================================
GDTR:   dw GDT.gdt_end - GDT - 1                ; ディスクリプタテーブルのリミット
        dd GDT                                  ; ディスクリプタテーブルのアドレス

;===============================================
; IDT（疑似：割り込み禁止にするため）
;===============================================
IDTR:   dw 0                                    ; IDTリミット
        dd 0                                    ; IDTアドレス

;******************************************************************
; ブート処理の第7ステージ
;******************************************************************
stage_7th:
        cli                                     ; 割り込み禁止

        ;---------------------------------------
        ; GDTロード
        ;---------------------------------------
        lgdt    [GDTR]                          ; グローバルディスクリプタテーブルをロード
        lidt    [IDTR]                          ; 割り込みディスクリプタテーブルをロード

        ;---------------------------------------
        ; プロテクトモードへ移行
        ;---------------------------------------
        mov     eax, cr0                        ; PEビットをセット
        or      ax, 1                           ; CR0 |= 1
        mov     cr0, eax                        ;

        jmp     $ + 2                           ; 先読みをクリア

        ;---------------------------------------
        ; セグメント間ジャンプ
        ;---------------------------------------
[BITS 32]
        DB      0x66                            ; オペランドオーバーライドプレフィックス
        jmp     SEL_CODE:CODE_32                ;

;******************************************************************
; 32ビットコード開始
;******************************************************************
CODE_32:
        ;---------------------------------------
        ; セレクタを初期化
        ;---------------------------------------
        mov     ax, SEL_DATA                    ; セグメントディスクリプタと同じオフセット値をセット
        mov     ds, ax
        mov     es, ax
        mov     fs, ax
        mov     gs, ax
        mov     ss, ax

        ;---------------------------------------
        ; カーネル部をコピー
        ;---------------------------------------
        mov     ecx, (KERNEL_SIZE) / 4          ; ECX = 4バイト単位でコピー
        mov     esi, BOOT_END                   ; ESI = 0x0000_9C00 // カーネル部
        mov     edi, KERNEL_LOAD                ; EDI = 0x0010_1000 // 上位メモリ
        cld                                     ; DFクリア
        rep     movsd                           ; while(--ECX) *EDI++ = *ESI++

        ;---------------------------------------
        ; カーネル処理に移行
        ;---------------------------------------
        jmp     KERNEL_LOAD                     ; カーネルの先頭にジャンプ

;******************************************************************
; パディング（ブートプログラムを8Kバイトにする）
;******************************************************************
        times BOOT_SIZE - ($ - $$)      db 0    ; パディング