draw_rotation_bar:
        ;---------------------------------------
        ; 【レジスタの保存】
        ;---------------------------------------
        push    eax

        ;---------------------------------------
        ; タイマー割り込みカウンタを確認
        ;---------------------------------------
        mov     eax, [TIMER_COUNT]              ; EAX = タイマー割り込みカウンタ
        shr     eax, 4                          ; EAX /= 4 16で除算
        cmp     eax, [.index]                   ; EAXが前回値から変わっているか確認
        je      .10E                            ; 変わっていればローテーションバーを表示

        mov     [.index], eax                   ; 前回値 = EAX
        and     eax, 0x03                       ; EAX &= 0x03 値を0~3に限定

        mov     al, [.table + eax]              ; AL = table[index]
        cdecl   draw_char, 0, 29, 0x000F, eax   ; draw_char() 文字を表示

.10E:
        ;---------------------------------------
        ; 【レジスタの復帰】
        ;---------------------------------------
        pop     eax

        ret

ALIGN   4, dd 0
.index:     dd 0
.table:     db "|/-\"