draw_color_bar:
        ;---------------------------------------
        ; 【スタックフレームの構築】
        ;---------------------------------------
                                                ; EBP + 12| 行
                                                ; EBP +  8| 列
                                                ; EBP +  4| IP（戻り番地）
        push    ebp                             ; EBP +  0| BP（元の値）
        mov     ebp, esp                        ; ------|-----------

        ;---------------------------------------
        ; 【レジスタの保存】
        ;---------------------------------------
        push    eax
        push    ebx
        push    ecx
        push    edx
        push    esi
        push    edi

        ;---------------------------------------
        ; 表示位置の基準となる位置を保存
        ;---------------------------------------
        mov     esi, [ebp + 8]                  ; ESI = X(列)
        mov     edi, [ebp + 12]                 ; EDI = Y(行)

        ;---------------------------------------
        ; カラーバーの表示
        ;---------------------------------------
        mov     ecx, 0                          ;
.10L:   cmp     ecx, 16                         ;
        jae     .10E                            ;

        mov     eax, ecx                        ; 桁位置は偶数列はESIで指定された位置で
        and     eax, 0x01                       ; 基数列はESIで指定された位置から8文字分
        shl     eax, 3                          ; 加算した位置にする
        add     eax, esi                        ;

        mov     ebx, ecx                        ; 行位置は2回に1回加算する
        shr     ebx, 1                          ;
        add     ebx, edi                        ;

        mov     edx, ecx                        ; 表示色テーブルから表示色を取得
        shl     edx, 1                          ; ECX *= 2
        mov     edx, [.t0 + edx]                ;

        cdecl   draw_str, eax, ebx, edx, .s0

        inc     ecx                             ;
        jmp     .10L                            ;
.10E:

        ;---------------------------------------
        ; 【レジスタの復帰】
        ;---------------------------------------
         pop    edi
         pop    esi
         pop    edx
         pop    ecx
         pop    ebx
         pop    eax

        ;---------------------------------------
        ; 【スタックフレームの破棄】
        ;---------------------------------------
        mov     esp, ebp
        pop     ebp

        ret

.s0:    db '        ', 0                        ; 8文字分のスペース（表示色だけ変更）

.t0:    dw 0x0000, 0x0800                       ; 表示色のテーブル
        dw 0x0100, 0x0900
        dw 0x0200, 0x0A00
        dw 0x0300, 0x0B00
        dw 0x0400, 0x0C00
        dw 0x0500, 0x0D00
        dw 0x0600, 0x0E00
        dw 0x0700, 0x0F00