init_pic:
        ;---------------------------------------
        ; 【レジスタの保存】
        ;---------------------------------------
        push    eax

        ;---------------------------------------
        ; マスタの設定
        ;---------------------------------------
        outp    0x20, 0x11                      ; ICW1 LTIM=0, SNGL=0, IC4=1
        outp    0x21, 0x20                      ; ICW2 割り込みベクタ番号
        outp    0x21, 0x04                      ; ICW3 スレーブ接続位置
        outp    0x21, 0x05                      ; ICW4 通常EOI
        outp    0x21, 0xFF                      ; マスタ割り込みマスク

        ;---------------------------------------
        ; スレイブの設定
        ;---------------------------------------
        outp    0xA0, 0x11                      ; ICW1 LTIM=0, SNGL=0, IC4=1
        outp    0xA1, 0x28                      ; ICW2 割り込みベクタ番号
        outp    0xA1, 0x02                      ; ICW3 スレーブID
        outp    0xA1, 0x01                      ; ICW4 通常EOI
        outp    0xA1, 0xFF                      ; マスタ割り込みマスク

        ;---------------------------------------
        ; 【レジスタの復帰】
        ;---------------------------------------
        pop     eax

        ret