wait_tick:
        ;---------------------------------------
        ; 【スタックフレームの構築】
        ;---------------------------------------
                                                ; EBP + 8| ウェイト回数
                                                ; EBP + 4| EIP（戻り番地）
        push    ebp                             ; EBP + 0| EBP（元の値）
        mov     ebp, esp                        ; ------|-----------

        ;---------------------------------------
        ; 【レジスタの保存】
        ;---------------------------------------
        push    eax
        push    ecx

        ;---------------------------------------
        ; ウェイト
        ;---------------------------------------
        mov     ecx, [ebp + 8]                  ; ECX = ウェイト回数
        mov     eax, [TIMER_COUNT]              ; EAX = TIMER

.10L:   cmp     [TIMER_COUNT], eax
        je      .10L
        inc     eax
        loop    .10L

        ;---------------------------------------
        ; 【レジスタの復帰】
        ;---------------------------------------
        pop     ecx
        pop     eax

        ;---------------------------------------
        ; 【スタックフレームの破棄】
        ;---------------------------------------
        mov     esp, ebp
        pop     ebp

        ret