        BOOT_LOAD       equ     0x7C00          ; ブートプログラムのロード位置
        ORG             BOOT_LOAD               ; ロードアドレスをアセンブラに指示

;******************************************************************
; マクロ
;******************************************************************
%include        "../include/macro.s"

;******************************************************************
; エントリポイント
;******************************************************************
entry:
        jmp     ipl                             ; IPLへジャンプ

        ;---------------------------------------
        ; BPB (BIOS Parameter Block)
        ;---------------------------------------
        times   90 - ($ - $$)  db  0x90

        ;---------------------------------------
        ; IPL (Initial Program Loader)
        ;---------------------------------------
ipl:
        cli                                     ; 割り込み禁止

        mov     ax, 0x0000                      ; AX = 0x0000 セグメントレジスタに設定する初期値
        mov     ds, ax
        mov     es, ax
        mov     ss, ax
        mov     sp, BOOT_LOAD                   ; スタックポインタにロード位置のアドレスを設定

        sti                                     ; 割り込み許可

        mov     [BOOT.DRIVE], dl                ; ブートドライブを保存

        ;---------------------------------------
        ; 文字列を表示
        ;---------------------------------------
        cdecl   puts, .s0                       ; puts(.s0)

        ;---------------------------------------
        ; 数値を表示
        ;---------------------------------------
        cdecl   itoa,   8086, .s1, 8, 10, 0b001  ; "    8086"
        cdecl   puts, .s1
        cdecl   itoa,   8086, .s1, 8, 10, 0b011  ; "+   8086"
        cdecl   puts, .s1
        cdecl   itoa,   -8086, .s1, 8, 10, 0b001 ; "-   8086"
        cdecl   puts, .s1
        cdecl   itoa,   -1, .s1, 8, 10, 0b001    ; "-      1"
        cdecl   puts, .s1
        cdecl   itoa,   -1, .s1, 8, 10, 0b000    ; "   65535"
        cdecl   puts, .s1
        cdecl   itoa,   -1, .s1, 8, 16, 0b000    ; "    FFFF"
        cdecl   puts, .s1
        cdecl   itoa,   12, .s1, 8, 2, 0b0100    ; "00001100"
        cdecl   puts, .s1

        ;---------------------------------------
        ; 処理終了
        ;---------------------------------------
        jmp     $                               ; while(1); // 無限ループ

        ;---------------------------------------
        ; データ
        ;---------------------------------------
.s0     db "Booting...", 0x0A, 0x0D, 0
.s1     db "--------", 0x0A, 0x0D, 0


ALIGN 2, db 0
BOOT:                                           ; ブートドライブに関する情報
.DRIVE:         dw 0                            ; ドライブ番号を定義

;******************************************************************
; モジュール
;******************************************************************
%include        "../modules/real/puts.s"
%include        "../modules/real/itoa.s"

;******************************************************************
; ブートフラグ（先頭512バイトの終了）
; 0xAA55 は「ブートシグネチャ」と呼ばれるMBRの有効性を示す決まった値のデータ
; $ : 現在の番地
; $$: 先頭番地
;******************************************************************
        times   510 - ($ - $$)  db  0x00
        db      0x55, 0xAA