puts:
        ;---------------------------------------
        ; 【スタックフレームの構築】
        ;---------------------------------------
                                                ; BP+ 0| BP（元の値）
        push    bp                              ; BP +2| IP（戻り番地）
        mov     bp, sp                          ; BP +4| 出力文字
                                                ; -----|----------

        ;---------------------------------------
        ; 【レジスタの保存】
        ;---------------------------------------
        push    ax
        push    bx
        push    si

        ;---------------------------------------
        ; 引数を取得
        ;---------------------------------------
        mov     si, [bp + 4]

        ;---------------------------------------
        ; 【処理の開始】
        ;---------------------------------------
        mov     ah, 0x0E                        ; テレタイプ式1文字出力
        mov     bx, 0x0000                      ; ページ番号と文字色を0に設定
        cld                                     ; Clear Direction Flag: DFを0にする
.10L:
        lodsb                                   ; AL = *SI++; と同義

        cmp     al, 0                           ; AL が 0 なら文字列の終端
        je      .10E                            ; 文字列の終端の場合は文字出力を終える

        int     0x10                            ; ビデオBIOSコール
        jmp     .10L                            ; ループの頭に戻る
.10E:

        ;---------------------------------------
        ; 【レジスタの復帰】
        ;---------------------------------------
        pop     si
        pop     bx
        pop     ax

        ;---------------------------------------
        ; 【スタックフレームの破棄】
        ;---------------------------------------
        mov     sp, bp
        pop     bp

        ret