read_lba:
        ;---------------------------------------
        ; 【スタックフレームの構築】
        ;---------------------------------------
                                                ; BP +10| 読み出し先アドレス
                                                ; BP + 8| 読み出しセクタ数
                                                ; BP + 6| LBA
                                                ; BP + 4| ドライブパラメータ格納アドレス
                                                ; BP + 2| IP（戻り番地）
        push    bp                              ; BP + 0| BP（元の値）
        mov     bp, sp                          ; -----|----------

        ;---------------------------------------
        ; 【レジスタの保存】
        ;---------------------------------------
        push    si

        ;---------------------------------------
        ; 【処理の開始】
        ;---------------------------------------
        mov     si, [bp + 4]                    ; SI = ドライブ情報

        ;---------------------------------------
        ; LBA→CHS変換
        ;---------------------------------------
        mov     ax, [bp + 6]                    ; AX = LBA
        cdecl   lba_chs, si, .chs, ax           ; lba_chs(drive, .chs, AX)

        ;---------------------------------------
        ; ドライブ番号のコピー
        ;---------------------------------------
        mov     al, [si + drive.no]             ;
        mov     [.chs + drive.no], al           ; ドライブ番号

        ;---------------------------------------
        ; セクタの読み込み
        ;---------------------------------------
        cdecl   read_chs, .chs, word [bp + 8], word [bp + 10]
                                                ; AX = read_chs(.chs, セクタ数, ofs)

        ;---------------------------------------
        ; レジスタの復帰
        ;---------------------------------------
        pop     si

        ;---------------------------------------
        ; 【スタックフレームの破棄】
        ;---------------------------------------
        mov     sp, bp
        pop     bp

        ret

ALIGN 2
.chs:   times drive_size    db 0                ; 読み込みセクタに関する情報