int_timer:
        ;---------------------------------------
        ; 【レジスタの保存】
        ;---------------------------------------
        pusha                                   ; スタックに全ての汎用レジスタのデータをプッシュ
        push    ds
        push    es

        ;---------------------------------------
        ; データ用セグメントセレクタの設定
        ;---------------------------------------
        mov     ax, 0x0010                      ; GDTの先頭からのバイト数
        mov     ds, ax
        mov     es, ax

        ;---------------------------------------
        ; TICK
        ;---------------------------------------
        inc     dword [TIMER_COUNT]             ; TIMER_COUNT++ 割り込み回数の更新

        ;---------------------------------------
        ; 割り込み終了コマンドの送信
        ;---------------------------------------
        outp    0x20, 0x20                      ; マスタPICにEOIコマンド送信

        ;---------------------------------------
        ; 【レジスタの復帰】
        ;---------------------------------------
        pop     es
        pop     ds
        popa

        iret                                    ; 割り込み処理の終了

ALIGN   4, dd 0
TIMER_COUNT:    dq 0